Revit 2027 API
EnergyDataSettings.OutsideAirPerPerson Property
Note: This API is now obsolete.
 The rate of flow of outside air available per person.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public double OutsideAirPerPerson { get; set; }
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Property OutsideAirPerPerson As Double
	Get
	Set
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property double OutsideAirPerPerson {
	double get ();
	void set (double value);
}
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member OutsideAirPerPerson : float with get, set
Property Value
Double
Remarks
 Stored in cubic feet per hour.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace